# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input('Введите трехзначное число: '))
sum = 0
x = 0
while n > 0:
    x = n % 10
    sum = int(sum + x)
    n = n / 10
print(sum)
